update framework to accept differents archs, and CFG
